no_riblet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\\    /   O peration     | Website:  https://openfoam.org
\\  /    A nd           | Version:  7
\\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../parameters.dat"


convertToMeters 1e-6;


xCells 140;
yCells 60;

vertices
(
  (0.000  0.000  0.000)	 //vertex 0
  (500.  0.000  0.000)	 //vertex 1
  (0.  200.  0.000)	 //vertex 2
  (500.  200.  0.000)	 //vertex 3
  //next z-slice
  (0.000  0.000  100)	 //vertex 0
  (500.  0.000  100)	 //vertex 1
  (0.  200.  100)	 //vertex 2
  (500.  200.  100)	 //vertex 3

);


blocks
(
  hex (0 1 3 2 4 5 7 6) 	($xCells $yCells 1) 	simpleGrading (1 1 1)      	//riblet 0, block 0
);


edges();


boundary
(


  upperWall
  {
    type patch;
    faces
    (
      (2 3 7 6)

    );
  }


  leftWall
  {
    type patch;
    faces
    (
      (0 2 6 4)
    );
  }


  rightWall
  {
    type patch;
    faces
    (
      (1 5 7 3)
    );
  }

  lowerWall
  {
    type wall;
    faces
    (
      (0 4 5 1)

    );
  }

);


mergePatchPairs();
