no_riblet/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../parameters.dat"

phases (biofilm fluid);

biofilm
{
    transportModel  Newtonian;
    nu              1e-3;
    rho             1000;
}

fluid
{
    //now represents water
    transportModel  Newtonian;
    nu              1e-6;
    rho             1000;
}

//this is usually set in the params file but we'll modify it here to make things more
//condensed
sigma            1e-3;

// ************************************************************************* //
